
### :robot: Terraform Report
---
##### Plan: `1` to add, `9` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_repository_permissions.this["check-git"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "check-git"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["fuzzy-engine"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "fuzzy-engine"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["helm-viewer"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "helm-viewer"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["image-operator"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "image-operator"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["k8s-labels-migrator"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "k8s-labels-migrator"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["network-inventory"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "network-inventory"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["proxmox-sdk"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "proxmox-sdk"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["repo-config"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "repo-config"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_actions_repository_permissions.this["s3-prometheus-exporter"] will be updated in-place
  ~ resource "github_actions_repository_permissions" "this" {
      ~ allowed_actions = "selected" -> "all"
        id              = "s3-prometheus-exporter"
        # (2 unchanged attributes hidden)

      - allowed_actions_config {
          - github_owned_allowed = true -> null
          - patterns_allowed     = [
              - "ahmadnassri/action-terraform-report@*",
              - "fuxingloh/multi-labeler@*",
              - "helm/chart-testing-action@*",
              - "helm/kind-action@*",
              - "release-drafter/release-drafter@*",
              - "stefanprodan/helm-gh-pages@*",
            ] -> null
          - verified_allowed     = true -> null
        }
    }

  # github_repository_file.renovate_json["network-inventory"] will be created
  + resource "github_repository_file" "renovate_json" {
      + autocreate_branch_source_sha = (known after apply)
      + branch                       = "master"
      + commit_author                = "Terraform Bot"
      + commit_email                 = "terraform@corentinfiloche.xyz"
      + commit_message               = "chore: create or upgrade renovate configuration"
      + commit_sha                   = (known after apply)
      + content                      = jsonencode(
            {
              + "$schema"           = "https://docs.renovatebot.com/renovate-schema.json"
              + extends             = [
                  + "config:recommended",
                  + "group:allNonMajor",
                ]
              + labels              = [
                  + "renovate",
                ]
              + lockFileMaintenance = {
                  + automerge = true
                  + enabled   = true
                }
              + packageRules        = [
                  + {
                      + automerge           = true
                      + matchCurrentVersion = "!/^0/"
                      + matchUpdateTypes    = [
                          + "minor",
                          + "patch",
                        ]
                    },
                ]
            }
        )
      + file                         = "renovate.json"
      + id                           = (known after apply)
      + overwrite_on_create          = true
      + ref                          = (known after apply)
      + repository                   = "network-inventory"
      + sha                          = (known after apply)
    }

Plan: 1 to add, 9 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12164776121`](https://github.com/Tchoupinax/repo-config/actions/runs/12164776121) - commit aefdca785f879bb9b2576a57174172d7ba200da1
